<?php

namespace Database\Seeders;

use App\Models\News;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        News::create([
            'title' => '«TASHKENT INVEST» во главе стратегии городского развития',
            'image' => 'https://static.tildacdn.com/tild3065-6139-4836-b865-376162366533/__2024-05-15__23425A.png',
            'content' => 'В свете стратегических планов Президента Узбекистана Шавката Мирзиёева по социально-экономическому развитию столицы, Ташкент принял решение вернуться в рейтинги международного агентства Fitch и войти к 2030 году в топ 50 городов мира для комфортного проживания. Этот шаг становится важным элементом стратегии, направленной на улучшение позиций города не только в индексах Fitch, но и в других мировых оценочных рейтингах.

                        На этом фоне решение о создании в мае 2023 года компании АО «Tashkent Invest Company» при учредительстве столичного хокимията выглядит весьма смелым и неординарным. Цель компании — стать ключевым инструментом для привлечения инвестиций и реализации стратегических реформ в городском хозяйстве. Партнёрство с международными и внутренними инвесторами, осуществление проектов в области экологии, градостроения и цифровизации — вот лишь несколько направлений работы «Tashkent Invest».

                        Подробнее о том, как столица готовится стать центром экономического и городского развития, читайте в материале редакции The Mag.

                        В 2023 году с запуском компании «Tashkent Invest» Ташкент вступил в новую фазу развития. Такое решение было принято Указом Президента Республики Узбекистан от 26 июля о развитии Ташкента до 2030 года. Этот шаг призван стать частью амбициозной стратегии, направленной на создание сбалансированной и процветающей городской среды, в которой жители и гости столицы смогут наслаждаться современными технологиями и высоким качеством жизни.


                        К 2030 году Ташкент, согласно планам, должен войти в топ 50 наиболее удобных для проживания городов по рейтингу Economist Intelligence Unit (сейчас он на 157-м месте), объём ВВП предполагается довести до 500 трлн сумов (с 178,9 трлн сумов). Планируются проекты в сфере промышленности и услуг на сумму 40 млрд долларов, увеличение объёма экспорта отраслей промышленности, услуг и туризма до 7,5 млрд сумов, расширение и полная модернизация инженерно-коммуникационных сетей.',

            'link' => 'https://toshkentinvest.uz/tpost/hy1cya0s11-tashkent-invest-vo-glave-strategii-gorod',
            'published_at' => now(),
        ]);

        News::create([
            'title' => 'Ташкент в топ-50 городов мира',
            'image' => 'https://static.tildacdn.com/tild3034-3663-4534-b032-356432373931/Tashkent-City_name_s.jpg',
            'content' => 'Мы поговорили со специалистами из «Компания Ташкент Инвест», которые собираются сделать столицу Узбекистана одним из самых удобных для проживания городов мира, заняв соответствующие позиции в рейтинге Economist Intelligence Unit.

            Чтобы войти в лучшие 50 городов мира, эксперты «Компания Ташкент Инвест» займутся привлечением внешних инвестиций и повышением туристической привлекательности, цифровизацией столицы, «нормализацией» базаров, благоустройством набережных.

            Изменения будут касаться также общественного транспорта, озеленения территорий, создания новых сити-парков, реорганизации каналов, обновления дорожного покрытия и многого другого: к 2030 году Ташкент должен стать настоящим «умным городом».

            Читайте в нашем материале, как столь масштабный план планируют осуществить уже совсем скоро, и что для этого понадобится.',
            'link' => 'https://toshkentinvest.uz/tpost/552dltdp01-tashkent-v-top-50-gorodov-mira',
            'published_at' => now()->subDays(2),
        ]);

        News::create([
            'title' => 'Депутаты кенгаша Ташкента одобрили выделение 1 трлн сумов на формирование уставного капитала',
            'image' => 'https://static.tildacdn.com/tild3030-3035-4561-b935-346537663037/162914_62206f66143f5.jpg',
            'content' => 'Кенгаш народных депутатов Ташкента на заседании 12 февраля одобрил выделение 1 трлн сумов на формирование уставного капитала государственной компании «Ташкент инвест», которая должна стать «мостом» между хокимиятом столицы и бизнесом.

            1,18 млрд сумов решено направить на покупку запчастей для транспорта Специализированного управления по эксплуатации, содержанию и ремонту городских центральных улиц.

            Ещё 151,79 млн сумов выделяется Главному управлению благоустройства для ремонта стены вокруг отдела по использованию транспортных средств в махалле «Олтинводий» в Сергелийском районе.

            Напомним, АО «Ташкент инвест» было создано указом президента в конце июля прошлого года при учредительстве хокимията. Её уставной капитал должен был поэтапно составить 1 трлн сумов за счёт дополнительных источников городского бюджета на основании решений кенгаша.

            За направление средств на проекты и другие цели, а также привлечение кредитов банков и международных финансовых институтов будет отвечать наблюдательный совет компании.

            Основными направлениями работы «Ташкент инвест» определены:

            анализ состояния имущества городского и районных хокимиятов, а также их предприятий и учреждений (муниципальное имущество), выявление имеющихся ресурсов и возможностей, разработка предложений по их эффективному использованию;
            управление муниципальными активами, реализация проектов государственно-частного партнёрства на их основе в качестве государственного партнёра и их сдача в аренду и управление предпринимателям, мониторинг и оценка их эффективности;
            повышение инвестиционной привлекательности объектов муниципальной собственности, реализация инвестпроектов на их основе с инвесторами;
            участие в финансировании перспективных проектов предпринимателей, связанных с развитием инфраструктуры Ташкента, исходя из их финансовой привлекательности и эффективности;
            организация разработки программ развития и реновации отдельных районов Ташкента, мастер-плана и проектной документации объектов, запланированных к строительству и другие.',
            'link' => 'https://toshkentinvest.uz/tpost/isj0glos31-deputati-kengasha-tashkenta-odobrili-vid',
            'published_at' => now()->subDays(2),
        ]);

        News::create([
            'title' => 'Создан Фонд развития Ташкента',
            'image' => 'https://static.tildacdn.com/tild3638-6139-4133-a662-306137326333/congress_hall.jpg',
            'content' => 'Компания также будет управлять Фондом развития инфраструктуры предпринимательства при хокимияте, который переименовывается в Фонд развития Ташкента. Его цели — «финансирование инфаструктурных проектов и оперативное решение неотложных вопросов в коммунальной и иных сферах повседневной жизни населения».

            Источниками финансирования фонда станут:

            доходы от проектов, финансируемых фондом, в том числе выручка от продажи созданных активов «Ташкент инвест»;
            доходы от проектов ГЧП, в которых компания хокимията участвовала в качестве государственного партнёра;
            70% средств, полученных от приватизации земельных участков несельскохозяйственного назначения в Ташкенте и реализации права аренды участков через аукцион, за вычетом расходов, определяемых правительством, а также часть, которая направляется в бюджет района, на территории которой расположена земля. Исключение — специальные экономические зоны, малые, молодёжные, промышленные и деловые зоны и территории business city;
            50% от суммы штрафов за нарушения Правил дорожного движения, зафиксированные средствами фото- и видеофиксации в Ташкенте, которые перечисляются в местный бюджет города;
            часть специальной надбавки, установленной к тарифам на услуги питьевого водоснабжения и канализации;
            20% от установленной законодательством платы за размещение объектов наружной рекламы и информации в Ташкенте;
            100% платы за разработку архитектурно-планировочного задания на проектирование строительства или реконструкции градостроительного объекта для покрытия части затрат на создание инженерно-коммуникационных сетей и транспортной инфраструктуры в столице;
            доходы от размещения денег в банках;
            отчисления из части перевыполненного плана по доходам городского бюджета;
            спонсорские пожертвования физических и юридических лиц, гранты международных финансовых институтов и иностранных организаций.

            Деньги фонда будут тратиться на реализацию проектов ГЧП, перспективных проектов, связанных с развитием инфраструктуры Ташкента, программы развития и реновации отдельных районов столицы, разработку мастер-плана и проектной документации строящихся объектов, строительство, реконструкцию, капитальный ремонт и оснащение объектов экономики и социальной сферы, благоустройство и озеленение территорий.

            Фонд также будет направлять средства на создание инфраструктуры (вода, канализация, электричество, газ и автодороги) в строящихся массивах «Новый Узбекистан», массивах, включённых в госпрограммы жилищного строительства, а также в специальных экономических зонах и малых промзонах (питьевая вода и канализация, электроснабжение, сети природного газа и автомобильные дороги).

            Деньги также будут выделятьс на обеспечение инженерно-коммуникационных сетей для объектов стоимостью более 200 млрд сумов, где доля собственных средств инвестора составляет не менее 25%. В этот список входят и проекты, включённые в инвестиционные программы, а также проекты придорожной инфраструктуры вдоль автомобильных дорог международного и республиканского значения.',
            'link' => 'https://toshkentinvest.uz/tpost/s22u9ic521-sozdan-fond-razvitiya-tashkenta',
            'published_at' => now()->subDays(2),
        ]);

        News::create([
            'title' => 'Специальная госкомпания станет «мостом» между хокимиятом Ташкента и бизнесом',
            'image' => 'https://static.tildacdn.com/tild6464-3337-4864-b164-643761313036/upscaled_image.png',
            'content' => 'При учредительстве столичного хокимията создаётся специальная компания в форме акционерного общества «Ташкент инвест», которая должна служить «мостом» между администрацией города и предпринимателями. Об этом говорится в указе президента Узбекистана от 26 июля о развитии Ташкента до 2030 года.

            Уставной капитал компании поэтапно составит 1 трлн сумов за счёт дополнительных источников городского бюджета на основании решений кенгаша.

            За направление средств на проекты и другие цели, а также привлечение кредитов банков и международных финансовых институтов будет отвечать наблюдательный совет компании.

            Основными направлениями работы «Ташкент инвест» определены:

            анализ состояния имущества Ташкентского городского и районных хокимиятов, а также их предприятий и учреждений (муниципальное имущество), выявление имеющихся ресурсов и возможностей, разработка предложений по их эффективному использованию;
            управление муниципальными активами, реализация проектов государственно-частного партнёрства на их основе в качестве государственного партнёра и их сдача в аренду и управление предпринимателям, мониторинг и оценка их эффективности;
            повышение инвестиционной привлекательности объектов муниципальной собственности, реализация инвестпроектов на их основе с инвесторами.
            участие в финансировании перспективных проектов предпринимателей, связанных с развитием инфраструктуры Ташкента, исходя из их финансовой привлекательности и эффективности.
            организация разработки программ развития и реновации отдельных районов Ташкента, мастер-плана и проектной документации объектов, запланированных к строительству.
            анализ деятельности предприятий госсектора Ташкента, разработка предложений по трансформации их деятельности.
            координация работ по строительству и реконструкции в Ташкенте и процессов подключения к инфраструктурным сетям.

            Документом утверждены механизмы реализации проектов между «Ташкент инвест» и предпринимателями на базе земельных участков.

            Предусмотрено, что Кабинет министров сдаёт компании земли в аренду на срок не более 49 лет. «Ташкент инвест» оценивает стоимость этих участков через оценочные организации.

            После оформления мастер-плана инвестиционного проекта, проектных документов и других разрешений земельные участки выставляются на электронный аукцион для реализации на них проектов совместно с «Ташкент инвест» по её заказу.

            Цена, сформировавшаяся по итогам аукциона, станет вкладом победителя аукциона в уставный капитал хозяйственного общества, которое должно быть создано в течение года. При этом доля компании хокимията в капитале создаваемого хозобщества будет составлять до 50%. Как она будет сформирована, не уточняется.

            В учредительных документах созданного предприятия доля «Ташкент инвест» может быть отчуждена путём продажи или получения части построенного объекта или его стоимости. При этом стоимость доли не должна быть меньше стоимости госактива, сформированного на аукционе.

            Компания «Ташкент инвест» на базе предоставляемых ей земельных участков для реализации совместных инвестпроектов сможет создавать простые товарищества с победителями аукционов, без образования хозяйственного общества.',
            'link' => 'https://toshkentinvest.uz/tpost/uzpea9heo1-spetsialnaya-goskompaniya-stanet-mostom',
            'published_at' => now()->subDays(2),
        ]);
    }
}
